Can't create Opening cut.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotCreateOpeningCutOut { get; }
  Visual Basic
Public Shared ReadOnly Property CannotCreateOpeningCutOut As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotCreateOpeningCutOut {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CreationFailures Class
  Autodesk.Revit.DB Namespace